src/1c/src/Documents/КурьерскаяЗаявка/КурьерскаяЗаявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КурьерскаяЗаявка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/1c/src/InformationRegisters/СтатусыКурьерскихЗаявок/СтатусыКурьерскихЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКурьерскихЗаявок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКурьерскихЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.КурьерскаяЗаявка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/1c/src/Documents/КурьерскаяЗаявка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		Статус = СтатусЗаявки(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусЗаявки(Заявка)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтатусыКурьерскихЗаявокСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.СтатусыКурьерскихЗаявок.СрезПоследних КАК СтатусыКурьерскихЗаявокСрезПоследних
	|ГДЕ
	|	СтатусыКурьерскихЗаявокСрезПоследних.Заявка = &Заявка");

	Запрос.УстановитьПараметр("Заявка", Заявка);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Статус", Статус);
КонецПроцедуры
